## Plan Result (braze-content-proxy-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/10600621119)



<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_wafv2_ip_set.AllowlistIPs
  * aws_wafv2_web_acl.BrazeContentProxy-waf
  * aws_wafv2_web_acl_association.application_application_waf_association_198E2B0A
* Update
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_security_group.application_application_load_balancer_alb_security_group_7B45D070 will be updated in-place
  ~ resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-09dedbc3586a7e253"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = [
                  + "pl-3b927c52",
                ]
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "BrazeContentProxy-Prod-HTTP/S Security Group20220421204735345000000006"
        tags                   = {
            "Name" = "BrazeContentProxy-Prod-HTTP/S Security Group"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_wafv2_ip_set.AllowlistIPs will be created
  + resource "aws_wafv2_ip_set" "AllowlistIPs" {
      + addresses          = [
          + "18.205.178.15/32",
          + "23.21.118.191/32",
          + "34.206.23.173/32",
          + "50.16.249.9/32",
          + "52.4.160.214/32",
          + "52.54.89.238/32",
          + "54.156.35.251/32",
          + "54.87.8.34/32",
        ]
      + arn                = (known after apply)
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "BrazeContentProxy-Prod-AllowList"
      + scope              = "REGIONAL"
      + tags               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-brazecontentproxy"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "BrazeContentProxy"
        }
      + tags_all           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-brazecontentproxy"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "BrazeContentProxy"
        }
    }

  # aws_wafv2_web_acl.BrazeContentProxy-waf will be created
  + resource "aws_wafv2_web_acl" "BrazeContentProxy-waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Waf for BrazeContentProxy Prod environment"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "BrazeContentProxy-waf-Prod"
      + scope                       = "REGIONAL"
      + tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-brazecontentproxy"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "BrazeContentProxy"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "BrazeContentProxy-Prod-ipAllowList"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BrazeContentProxy-Prod-ipAllowList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "BrazeContentProxy-Prod-ipBlockAll"
          + priority = 2

          + action {
              + count {
                }
            }

          + statement {
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BrazeContentProxy-Prod-ipBlockAll"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "BrazeContentProxy-waf-Prod"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.application_application_waf_association_198E2B0A will be created
  + resource "aws_wafv2_web_acl_association" "application_application_waf_association_198E2B0A" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:cloudfront::996905175585:distribution/E32KNCVV2FTQJF"
      + web_acl_arn  = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":702,"Program":"tfcmt","SHA1":"cb897fe8f902ab2dc73d7114f0dfe292bbe83e3c","Target":"braze-content-proxy-cdk-production","Vars":{},"WorkflowName":"Braze Content Proxy"} -->